export const errorMessages = {
  wrongCredentials: 'Вы ввели неправильный логин или пароль.',
  badToken: 'При авторизации произошла ошибка. Токен не передан или передан не в том формате.',
  wrongToken: 'При авторизации произошла ошибка. Переданный токен некорректен.',
  userExist: 'Пользователь с таким email уже существует.',
  couldNotRegister: 'При регистрации пользователя произошла ошибка.',
  emaiExists: 'Пользователь с таким email уже существует.',
  profileUpdate: 'При обновлении профиля произошла ошибка.',
  serverError: 'На сервере произошла ошибка.',
  pageNotFound: 'Страница по указанному маршруту не найдена.',
  emptySearchInput: 'Нужно ввести ключевое слово',
  requestError:
    'Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз.',
  nothingFound: 'Ничего не найдено',
  profileUpdateError: 'При обновлении профиля произошла ошибка'
};
