export const errorMessages = {
  wrongCredentials: 'Вы ввели неправильный логин или пароль.',
  badToken: 'При авторизации произошла ошибка. Токен не передан или передан не в том формате.',
  wrongToken: 'При авторизации произошла ошибка. Переданный токен некорректен.',
  userExist: 'Пользователь с таким email уже существует.',
  couldNotRegister: 'При регистрации пользователя произошла ошибка.',
  emaiExists: 'Пользователь с таким email уже существует.',
  profileUpdate: 'При обновлении профиля произошла ошибка.',
  serverError: 'На сервере произошла ошибка.',
  pageNotFound: 'Страница по указанному маршруту не найдена.',
  emptySearchInput: 'Нужно ввести ключевое слово',
  requestError:
    'Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз.',
  nothingFound: 'Ничего не найдено',
  profileUpdateError: 'При обновлении профиля произошла ошибка',
  loginWrongCredentials: 'Неправильные почта или пароль',
  loginError: 'Ошибка логина...'
};

export const ERROR_MESSAGES = {
  WRONG_CREDEINTIALS: 'Вы ввели неправильный логин или пароль.',
  BAD_TOKEN: 'При авторизации произошла ошибка. Токен не передан или передан не в том формате.',
  WRONG_TOKEN: 'При авторизации произошла ошибка. Переданный токен некорректен.',
  USER_EXISTS: 'Пользователь с таким email уже существует.',
  COULD_NOT_REGISTER: 'При регистрации пользователя произошла ошибка.',
  EMAIL_EXIST: 'Пользователь с таким email уже существует.',
  SERVER_ERROR: 'На сервере произошла ошибка.',
  PAGE_NOT_FOUND: 'Страница по указанному маршруту не найдена.',
  EMPTY_INPUT: 'Нужно ввести ключевое слово',
  REQUEST_ERROR:
    'Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз.',
  NOTHING_FOUND: 'Ничего не найдено',
  PROFILE_UPDATE: 'При обновлении профиля произошла ошибка',
  WRONG_CREDENTIALS: 'Неправильные почта или пароль',
  LOGIN_ERROR: 'Ошибка логина...'
};
